In [80]:
import pandas as pd
import numpy as np
import re

In [10]:
student =[{
    "Name":"Daniyal",
    "Age":42,
    "Course":"AI"
},{
    "Name":"Mohsin",
    "Age":42,
    "Course":"CNCF"
},{
    "Name":"Amir",
    "Age":42,
  
},{
  
    "Course":"AI"
},{
    "Name":"Sadiq",
   
    "Course":"AI"
}]

In [11]:
studentData = pd.DataFrame(student)

In [12]:
studentData

    Age Course     Name
0  42.0     AI  Daniyal
1  42.0   CNCF   Mohsin
2  42.0    NaN     Amir
3   NaN     AI      NaN
4   NaN     AI    Sadiq

In [13]:
isNullValue =studentData.notnull()
isNullValue

     Age  Course   Name
0   True    True   True
1   True    True   True
2   True   False   True
3  False    True  False
4  False    True   True

In [14]:
FillFawValue =studentData.fillna(method="ffill")
FillFawValue

    Age Course     Name
0  42.0     AI  Daniyal
1  42.0   CNCF   Mohsin
2  42.0     AI     Amir
3   NaN     AI    Sadiq
4   NaN     AI    Sadiq

In [17]:
FillBackValue =studentData.fillna(method="ffill")
FillBackValue

    Age Course     Name
0  42.0     AI  Daniyal
1  42.0   CNCF   Mohsin
2  42.0   CNCF     Amir
3  42.0     AI     Amir
4  42.0     AI    Sadiq

In [21]:
fillanyValue =studentData.fillna({"Age":5,"Course":"Un-Known"})
fillanyValue

    Age    Course     Name
0  42.0        AI  Daniyal
1  42.0      CNCF   Mohsin
2  42.0  Un-Known     Amir
3   5.0        AI      NaN
4   5.0        AI    Sadiq

In [29]:
fillanyValue["Age"].map((lambda rec: rec*2))

0    84.0
1    84.0
2    84.0
3    10.0
4    10.0
Name: Age, dtype: float64

In [33]:
name = "sadiq skjds kjlk"

In [34]:
name.title()

'Sadiq Skjds Kjlk'

In [35]:
name.capitalize()

'Sadiq skjds kjlk'

# Discretization and Binning

In [36]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [40]:

bins = [18,25, 35, 60, 100] ## this is for catigories 18 say 24 tak ki age waly 25 waly say 35 tak ....

In [41]:
cats = pd.cut(ages,bins)

In [42]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [43]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [46]:
cats.codes ## 0 is the fist category(18 to 25) 1 is the second (25,35)....

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [47]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [62]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
print(df)
sampler = np.random.permutation(5)
sampler

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

array([3, 0, 1, 2, 4])

In [63]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19

In [78]:
df.sample(n=4,axis=1) ## axis = 0 is row and 1 is colume head

    2   0   3   1
0   2   0   3   1
1   6   4   7   5
2  10   8  11   9
3  14  12  15  13
4  18  16  19  17

# Computing Indicator/Dummy Variables

In [79]:
text = """Dave dave@google.com Steve steve@gmail.com Rob rob@gmail.com Ryan ryan@yahoo.com """ 
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [81]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [83]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [84]:
m = regex.search(text)

In [85]:
m

In [86]:
print(regex.match(text))

None